{
  "project": "gSnake",
  "description": "Reliability hardening backlog derived from FINDINGS (2026-02-15) and PRD 'gSnake Codebase Reliability Hardening'. Focus: remove critical panic/input-validation failures, centralize LevelDefinition contract validation, close high-priority test gaps, replace panic-oriented tooling paths, and document fragile engine semantics.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Replace critical snake-head unwrap in engine runtime path",
      "description": "As a player, I want malformed snake state to return a structured engine error instead of panicking so gameplay failure handling is safe.",
      "acceptanceCriteria": [
        "Replace head-segment access unwrap in gsnake-core/engine/core/src/engine.rs with explicit Result error handling",
        "Return an EngineError variant with clear message when snake has zero segments",
        "Normal gameplay behavior remains unchanged for valid state",
        "Add or update a regression test proving malformed state returns error and does not panic",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Enforce grid-size validation before engine allocations",
      "description": "As a level author, I want invalid grid sizes rejected deterministically so the engine cannot panic or allocate unsafe frame buffers.",
      "acceptanceCriteria": [
        "Validate gridSize in engine construction path before any frame/grid allocation",
        "Reject non-positive gridSize values with explicit InvalidGridSize-style error",
        "Reject oversized gridSize values beyond a defined safe frame-cell cap",
        "Error messages include the invalid value to aid debugging",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add boundary tests for grid-size validation",
      "description": "As a maintainer, I want explicit tests for grid-size boundaries so validation behavior stays stable across refactors.",
      "acceptanceCriteria": [
        "Add tests covering negative, zero, minimum valid, maximum valid, and maximum+1 grid sizes",
        "Tests assert explicit error type/message for invalid values",
        "Tests assert successful engine creation for valid boundary values",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Harden level query parsing against NaN and non-integer input",
      "description": "As a web player, I want invalid `level` query params sanitized so game startup is always deterministic.",
      "acceptanceCriteria": [
        "Update gsnake-web/packages/gsnake-web-app/engine/WasmGameEngine.ts level parsing to reject NaN, empty, decimal, and non-numeric input",
        "Out-of-range values consistently fall back to level 1 (or current default behavior if explicitly documented)",
        "No invalid level parameter can place stores/engine in inconsistent startup state",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Add WasmGameEngine query-parameter regression tests",
      "description": "As a maintainer, I want tests for valid and invalid level query permutations so URL parsing regressions are caught quickly.",
      "acceptanceCriteria": [
        "Add unit tests covering valid integer, NaN, empty, decimal, text, below-range, and above-range level query values",
        "Tests assert selected level index/id after parsing and fallback",
        "Tests verify engine/store initialization remains consistent when invalid query input is provided",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Define canonical LevelDefinition schema artifact",
      "description": "As a maintainer, I want one canonical LevelDefinition contract source so schema changes do not drift across Rust, editor server, web, and E2E tests.",
      "acceptanceCriteria": [
        "Create a canonical LevelDefinition schema artifact in a shared location and document ownership",
        "Document how consumers regenerate or import derived validators/guards",
        "Include all currently used optional fields (floatingFood, fallingFood, stones, spikes, totalFood semantics)",
        "Add a minimal validation fixture set proving schema accepts valid and rejects invalid examples",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Integrate editor server with schema-driven LevelDefinition validation",
      "description": "As an editor maintainer, I want server validation to rely on the canonical schema so rule updates happen in one place.",
      "acceptanceCriteria": [
        "Refactor gsnake-editor/server.ts validation flow to call schema-driven validator module instead of scattered manual checks",
        "Keep response contract stable or document any intentional response-shape changes",
        "Return structured field-level validation errors for invalid payloads",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Replace duplicated E2E LevelDefinition guards with shared utility",
      "description": "As a test maintainer, I want E2E contract checks to reuse one shared guard so test suites cannot drift.",
      "acceptanceCriteria": [
        "Move duplicated isLevelDefinition-style checks from e2e specs into a shared utility module",
        "Update e2e/complete-workflow.spec.ts and e2e/level-validation.spec.ts to use shared utility",
        "No duplicated ad-hoc LevelDefinition guard logic remains in those specs",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Add contract drift test between canonical schema and runtime consumers",
      "description": "As a maintainer, I want automated drift detection so schema/validator mismatches fail fast in CI.",
      "acceptanceCriteria": [
        "Add a test or CI check that fails when canonical schema and consumer validators/types diverge",
        "Check covers at least editor server and web contract consumer paths",
        "Failure message explains how to regenerate/synchronize artifacts",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Add editor validation edge-case API tests",
      "description": "As a maintainer, I want editor API tests for risky input combinations so validation regressions are blocked.",
      "acceptanceCriteria": [
        "Add tests for gridSize=0 and negative/invalid coordinate payloads",
        "Add tests for invalid field combinations identified in FINDINGS",
        "Assert structured error payload fields and HTTP status behavior",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 10,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Add dedicated Cell.svelte component tests",
      "description": "As a web maintainer, I want direct Cell component coverage so rendering regressions are caught at component level.",
      "acceptanceCriteria": [
        "Create dedicated test file for Cell.svelte",
        "Cover rendering for major cell variants and state-dependent visual output used by gameplay",
        "Ensure test naming and structure match existing gsnake-web component test conventions",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 11,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Add dedicated Header.svelte component tests",
      "description": "As a web maintainer, I want Header component behavior covered so HUD/navigation state regressions are detected.",
      "acceptanceCriteria": [
        "Create dedicated test file for Header.svelte",
        "Cover displayed labels/actions for representative game state combinations",
        "Assert event callback wiring for header actions where applicable",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 12,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Add dedicated RestartButton.svelte component tests",
      "description": "As a web maintainer, I want RestartButton behavior validated so restart UX remains reliable.",
      "acceptanceCriteria": [
        "Create dedicated test file for RestartButton.svelte",
        "Cover enabled/disabled rendering and click handler invocation",
        "Assert accessibility-related button behavior used by existing component patterns",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 13,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Add KeyboardHandler tests for rapid and modifier-key input",
      "description": "As a gameplay maintainer, I want keyboard edge-case coverage so input handling stays stable under real user behavior.",
      "acceptanceCriteria": [
        "Add tests for rapid repeated directional key presses",
        "Add tests for modifier-key combinations and non-movement key behavior",
        "Assert input lock/queue behavior expected by engine integration",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 14,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Expand web contract tests for missing cell-type variants",
      "description": "As a contract maintainer, I want web contract tests to include all supported cell variants so serialization drift is caught.",
      "acceptanceCriteria": [
        "Extend gsnake-web/tests/contract/types.test.ts to include FloatingFood, FallingFood, Stone, and Spike variants",
        "Add mixed-variant fixture coverage where parsing/typing behavior differs",
        "Assert invalid variant payloads fail with expected validation errors",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 15,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Expand core engine contract stone-interaction matrix tests",
      "description": "As a core engine maintainer, I want broader stone interaction matrix coverage so physics contract behavior remains stable.",
      "acceptanceCriteria": [
        "Add tests in gsnake-core/engine/core/tests/contract_tests.rs for missing stone interaction combinations",
        "Document expected outcomes in test case names or inline test fixtures",
        "Ensure new matrix tests pass alongside existing gravity/collision suites",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 16,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-017",
      "title": "Replace unwrap/expect in CLI playback error paths",
      "description": "As a CLI user, I want playback tooling to return actionable errors instead of panicking on malformed input.",
      "acceptanceCriteria": [
        "Replace high-risk unwrap/expect usage in gsnake-core/engine/bindings/cli/src/playback.rs with Result propagation",
        "Attach context to propagated errors so failing file/parse stage is visible",
        "Add regression tests for malformed playback/file cases",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 17,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-018",
      "title": "Replace unwrap/expect in gsnake-levels generation path",
      "description": "As a tooling user, I want generation commands to fail gracefully so batch operations provide useful diagnostics.",
      "acceptanceCriteria": [
        "Replace targeted unwrap/expect sites in gsnake-levels/src/generate.rs with Result-based error propagation",
        "Preserve existing success-path behavior and output format",
        "Add tests for generation failures to verify stable error messaging",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 18,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-019",
      "title": "Replace unwrap/expect in gsnake-levels migration path",
      "description": "As a tooling user, I want migration commands to report failures without panicking so migration issues are easier to debug.",
      "acceptanceCriteria": [
        "Replace targeted unwrap/expect sites in gsnake-levels/src/migration.rs with Result-based handling",
        "Add contextual error messages for migration file and operation step",
        "Add tests for malformed migration inputs and missing resources",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 19,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-020",
      "title": "Introduce multi-error aggregation for levels validation workflows",
      "description": "As a maintainer, I want batch validation to report all issues in one run so remediation is faster than fail-fast panic loops.",
      "acceptanceCriteria": [
        "Implement an error aggregation pattern for at least one high-impact gsnake-levels validation workflow",
        "Output includes multiple actionable validation errors in a single command run",
        "Add tests proving aggregate behavior and stable output format",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 20,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-021",
      "title": "Document gravity and stone collision order dependency",
      "description": "As a contributor, I want clear documentation of physics order dependency so future edits do not introduce off-by-one regressions.",
      "acceptanceCriteria": [
        "Add focused explanatory comments in gsnake-core/engine/core/src/gravity.rs for order-sensitive collision logic",
        "Add or update developer documentation with a short rationale and maintenance guidance",
        "Reference at least one test covering this order dependency from docs/comments",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 21,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-022",
      "title": "Document level serialization semantics for optional fields",
      "description": "As an editor/runtime maintainer, I want totalFood and optional-field semantics explicitly documented so round-trip behavior stays consistent.",
      "acceptanceCriteria": [
        "Document semantics for totalFood, floatingFood, fallingFood, stones, and spikes in a single authoritative developer document",
        "Define round-trip expectations between editor model and server serialization",
        "Link documentation from the relevant editor/server source files",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 22,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-023",
      "title": "Centralize WasmGameEngine frame emission pattern documentation",
      "description": "As a web maintainer, I want one authoritative frame-emission guide so initialization/order assumptions remain consistent.",
      "acceptanceCriteria": [
        "Document required frame emission pattern (including explicit getFrame-after-create behavior) in one authoritative location",
        "Update implementation comments/README links so contributors can discover the pattern quickly",
        "Add or update regression test coverage that depends on this initialization sequence",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 23,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-024",
      "title": "Final reliability hardening verification sweep",
      "description": "As a release owner, I want a final integrated verification pass so the full reliability-hardening backlog ships with evidence.",
      "acceptanceCriteria": [
        "Run full required quality checks for impacted packages (typecheck, lint, tests) and resolve regressions",
        "Confirm no targeted critical/high findings remain unaddressed in implemented scope",
        "Update gsnake-specs/task artifacts or status notes with implemented outcomes and residual risks",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 24,
      "passes": false,
      "notes": ""
    }
  ]
}
