{
  "project": "gSnake",
  "description": "Address open reliability findings from gsnake-specs/tasks/findings-codebase-reliability-hardening.md (revalidated 2026-02-16), focusing on contract-validation drift, panic-prone tooling paths, solver/runtime performance, CI robustness, and security hardening.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Generate a shared TypeScript LevelDefinition validator from canonical schema",
      "description": "As a maintainer, I want one generated validator source so LevelDefinition validation logic does not drift across packages.",
      "acceptanceCriteria": [
        "Add a generation step that produces a runtime validator from contracts/level-definition.schema.json",
        "Generated artifact is committed in a shared location and documented",
        "Generation command is reproducible from repo root",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Adopt shared LevelDefinition validator in gsnake-web",
      "description": "As a web maintainer, I want gsnake-web to use the shared validator so contract checks stay aligned with the canonical schema.",
      "acceptanceCriteria": [
        "Replace manual guard usage in gsnake-web with the shared/generated validator",
        "Remove duplicated manual validation logic that is now redundant",
        "Existing level-load error behavior remains stable for invalid payloads",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Adopt shared LevelDefinition validator in E2E tests",
      "description": "As a test maintainer, I want E2E specs to reuse the shared validator so test-side contract logic cannot diverge.",
      "acceptanceCriteria": [
        "Replace e2e/level-definition.ts duplicate guard logic with imports from shared/generated validator",
        "Update affected E2E specs to use the shared validator path",
        "No local duplicate LevelDefinition guard remains in E2E test helpers",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Remove runtime unwrap/expect usage from CLI bindings",
      "description": "As a CLI user, I want malformed playback and level inputs to return actionable errors instead of panics.",
      "acceptanceCriteria": [
        "Replace runtime-path unwrap/expect calls in gsnake-core/engine/bindings/cli/src with Result propagation",
        "Error messages include context about failing file or parse step",
        "Add regression tests for malformed input paths",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Remove runtime unwrap/expect usage from gsnake-levels command paths",
      "description": "As a tooling user, I want gsnake-levels commands to fail gracefully so batch workflows are debuggable.",
      "acceptanceCriteria": [
        "Replace runtime-path unwrap/expect calls in gsnake-levels command modules with Result propagation",
        "Preserve existing success-path output behavior",
        "Add tests for representative failure scenarios",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Add aggregated error reporting to levels validation workflow",
      "description": "As a maintainer, I want validation commands to report multiple issues in one run so remediation is faster.",
      "acceptanceCriteria": [
        "Implement aggregation for at least one high-impact levels validation command",
        "Command output includes multiple validation failures in a single invocation",
        "Add tests that assert multi-error output behavior",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Baseline solver performance with repeatable profiling",
      "description": "As a maintainer, I want a reproducible solver performance baseline so optimization work is evidence-driven.",
      "acceptanceCriteria": [
        "Add a repeatable profiling or benchmark command for solve_level/playback generation",
        "Capture baseline metrics (wall time and hotspot summary) in repo documentation",
        "Document how to rerun profiling locally",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Eliminate per-level cargo process spawn in playback generation",
      "description": "As a maintainer, I want playback generation to avoid spawning cargo per level so solver throughput improves.",
      "acceptanceCriteria": [
        "Refactor playback generation to call solving logic without running cargo for each level",
        "Generated playback outputs remain format-compatible with current consumers",
        "Performance is measurably improved versus baseline for a representative level set",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Add non-blocking WASM startup with explicit loading state",
      "description": "As a player, I want immediate feedback during WASM initialization so first render does not appear stalled.",
      "acceptanceCriteria": [
        "Add explicit loading state for WASM initialization in gsnake-web app startup",
        "UI renders a loading indicator until engine init completes or fails",
        "Initialization errors still surface through existing error handling flow",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Document and reduce build.rs filesystem coupling in gsnake-levels",
      "description": "As a maintainer, I want build mode selection to be explicit so repo-layout-dependent behavior is predictable.",
      "acceptanceCriteria": [
        "Document current build.rs mode-switch behavior in gsnake-levels README",
        "Add an explicit override mechanism (flag or env var) for local-vs-standalone mode",
        "Keep existing default behavior for current workflows unless override is used",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 10,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Add property-based tests for gravity and stone invariants",
      "description": "As a core maintainer, I want invariant-based coverage for gravity interactions so order-dependent regressions are caught.",
      "acceptanceCriteria": [
        "Add property-based tests covering gravity/stone collision invariants in gsnake-core",
        "Include invariants for bounds safety and deterministic outcomes across equivalent states",
        "Tests run in CI without flaky behavior",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 11,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Define dependency update policy and automate security audits",
      "description": "As a repo owner, I want a documented update policy with automated audits so dependency risk is continuously managed.",
      "acceptanceCriteria": [
        "Add a dependency maintenance policy document with ownership and cadence",
        "Automate npm and cargo security audit checks in CI or scheduled workflow",
        "Document handling path for audit failures",
        "Typecheck passes"
      ],
      "priority": 12,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Restrict editor server CORS to explicit allowed ports",
      "description": "As a developer, I want CORS narrowed to known dev origins so localhost-wide trust is reduced.",
      "acceptanceCriteria": [
        "Replace wildcard localhost port allowance with explicit allowed origin list",
        "Allowed origins are configurable for local development",
        "Add server tests for allowed and rejected origin behavior",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 13,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Harden n8n workflow secrets usage away from broad $env access",
      "description": "As an operator, I want workflow secret handling to rely on scoped credentials so accidental env exposure risk is reduced.",
      "acceptanceCriteria": [
        "Audit gsnake-n8n code nodes for direct $env secret reads",
        "Move applicable secrets to n8n credential-backed access patterns",
        "Update workflow docs to reflect the hardened secret access model",
        "Typecheck passes"
      ],
      "priority": 14,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Add health endpoints for editor API and UI dev server checks",
      "description": "As a CI maintainer, I want explicit health endpoints so readiness checks are deterministic.",
      "acceptanceCriteria": [
        "Expose a lightweight /health endpoint for editor API server",
        "Expose or configure an equivalent deterministic health check for the editor/web server process used in CI",
        "Document expected health response contract",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 15,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Replace sleep-based CI startup waits with health-check polling and tighter process lifecycle",
      "description": "As a CI maintainer, I want server startup and teardown to be controlled by readiness checks so E2E jobs are less flaky.",
      "acceptanceCriteria": [
        "Update .github/workflows/ci.yml to wait on service health endpoints instead of fixed sleeps",
        "Reduce broad pkill/fuser cleanup to targeted process lifecycle handling",
        "E2E workflow runs successfully with the new startup/teardown logic",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 16,
      "passes": false,
      "notes": ""
    }
  ]
}
