{
  "project": "gSnake",
  "description": "Increase automated test coverage to 80%+ line coverage for gsnake-web, gsnake-editor, gsnake-core, and gsnake-levels with immediate blocking CI enforcement and expanded E2E quality gates.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Define package-level coverage command contract",
      "description": "As a maintainer, I need one documented coverage command per package so that local and CI execution are consistent.",
      "acceptanceCriteria": [
        "Document and align coverage commands for gsnake-web, gsnake-editor, gsnake-core, and gsnake-levels",
        "Coverage output locations are standardized and committed",
        "Running all four coverage commands locally succeeds",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add gsnake-web engine unit tests for initialization and error mapping",
      "description": "As a developer, I want deterministic tests for web engine initialization and contract error mapping so that regressions are caught early.",
      "acceptanceCriteria": [
        "Add unit tests for WasmGameEngine init success and failure paths",
        "Add assertions for contract error kind/message/context mapping",
        "Cover next-level and reset behavior using mocked wasm engine",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add gsnake-web store wiring tests",
      "description": "As a developer, I want tests for store event propagation so gameplay frame and error state updates remain correct.",
      "acceptanceCriteria": [
        "Add tests for levelChanged, frameChanged, and engineError handling in stores",
        "Assert snakeLength calculation and gameState synchronization from frame events",
        "Cover contract debug exposure behavior with and without contractTest query param",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Add gsnake-web UI tests for level loading and selector flows",
      "description": "As a player, I want level selection and load failure UX protected by tests so that navigation and errors behave correctly.",
      "acceptanceCriteria": [
        "Add component tests that cover level selector open/close and selecting a level",
        "Add tests for level load error modal visibility and dismiss flow",
        "Assert displayed labels/buttons for selector and load error states",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Add gsnake-web UI tests for completion and restart flows",
      "description": "As a player, I want completion banners and restart controls to remain reliable so level progression UX does not regress.",
      "acceptanceCriteria": [
        "Add component tests for level complete and all-complete UI states",
        "Add tests for restart button and keyboard-driven restart behavior through UI state",
        "Assert correct CTA visibility based on game state",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Add gsnake-editor server API negative-path tests",
      "description": "As a maintainer, I want editor API validation and failure paths covered so invalid payloads cannot silently regress behavior.",
      "acceptanceCriteria": [
        "Add tests for invalid/malformed payload rejection in editor API routes",
        "Add tests for missing payload and unsupported method responses",
        "Assert status codes and error payload structure",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Add gsnake-editor model and ID conversion tests",
      "description": "As a developer, I want strong tests around level schema and ID conversion logic so editor output matches runtime contracts.",
      "acceptanceCriteria": [
        "Add tests for numeric ID validation boundaries and invalid inputs",
        "Add tests for serialization shape used by save/export payloads",
        "Assert compatibility with expected level contract fields",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Add gsnake-editor UI tests for EditorLayout save/load workflow",
      "description": "As a level designer, I want save and load behavior covered so exported and imported levels preserve editor state.",
      "acceptanceCriteria": [
        "Add component tests for save modal opening, payload generation, and save action",
        "Add tests for loading valid level data and rendering resulting grid state",
        "Add tests for invalid load payload handling with user-facing error feedback",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Add gsnake-editor GridCanvas interaction and undo/redo tests",
      "description": "As a level designer, I want editing interactions and undo/redo protected so core authoring behavior remains stable.",
      "acceptanceCriteria": [
        "Add tests for entity placement/removal interactions in grid canvas",
        "Add tests for snake segment ordering behavior during edits",
        "Add tests that verify undo/redo stack behavior for multi-step edits",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Expand gsnake-core engine branch coverage",
      "description": "As a gameplay engineer, I want additional engine tests for uncovered branches so movement and gravity rules stay correct.",
      "acceptanceCriteria": [
        "Add tests for uncovered movement, collision, and gravity branches in core engine",
        "Add regression tests for any bug discovered while writing new tests",
        "Keep existing contract test fixtures passing",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 10,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Expand gsnake-core wasm binding coverage",
      "description": "As a maintainer, I want wasm binding behavior and error conversion paths covered so web integration remains reliable.",
      "acceptanceCriteria": [
        "Add tests for wasm binding initialization and error serialization paths",
        "Cover frame callback and direction parsing edge cases",
        "Ensure generated contract types remain compatible with web tests",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 11,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Expand gsnake-core CLI coverage",
      "description": "As a maintainer, I want CLI input/playback branches tested so command-line tooling regressions are caught.",
      "acceptanceCriteria": [
        "Add tests for CLI input mapping and playback parse failure paths",
        "Add tests for invalid file and malformed playback handling",
        "Assert expected exit behavior/messages for failure scenarios",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 12,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Expand gsnake-levels generation and sync coverage",
      "description": "As a content pipeline maintainer, I want level generation and metadata sync branches tested so metadata updates remain safe.",
      "acceptanceCriteria": [
        "Add tests for generate-levels-json and sync-metadata success/failure paths",
        "Cover path resolution behavior when running from root and package directories",
        "Add regression tests for any discovered metadata sync bug",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 13,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Expand gsnake-levels verification and playback coverage",
      "description": "As a maintainer, I want verify and playback tooling edge cases covered so broken level/playback files fail predictably.",
      "acceptanceCriteria": [
        "Add tests for verify, verify-all, and playback path inference error cases",
        "Add tests for malformed playback files and missing resource behavior",
        "Assert deterministic error messages and exit status behavior",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 14,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Add E2E coverage for gameplay progression flow",
      "description": "As a release owner, I want end-to-end gameplay progression scenarios so integration regressions are blocked.",
      "acceptanceCriteria": [
        "Add E2E scenario covering level play-through, completion, and next-level progression",
        "Add assertions for game-over and restart flows in browser",
        "Ensure scenario runs deterministically in CI with existing setup scripts",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 15,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Add E2E coverage for editor create-save-load flow",
      "description": "As a release owner, I want full editor workflow E2E coverage so level authoring regressions are caught before merge.",
      "acceptanceCriteria": [
        "Add E2E scenario covering editor create, entity placement, save, and reload",
        "Add assertions for API-backed test-level handoff from editor to web",
        "Ensure scenario is stable under CI service startup order",
        "Typecheck passes",
        "Tests pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 16,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-017",
      "title": "Fix source bugs discovered by new coverage tests",
      "description": "As a maintainer, I want bugs uncovered by coverage work fixed immediately so reaching 80% does not hide known defects.",
      "acceptanceCriteria": [
        "Fix each newly discovered bug in production code with minimal safe change",
        "Add regression test for each bug fixed",
        "No existing tests regress after bug fixes",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 17,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-018",
      "title": "Enforce gsnake-web 80% line threshold in CI",
      "description": "As a maintainer, I want gsnake-web coverage to block merges below 80% so web test coverage cannot regress.",
      "acceptanceCriteria": [
        "Set gsnake-web coverage threshold to at least 80% line coverage",
        "Coverage job fails when gsnake-web drops below threshold",
        "Coverage artifact upload remains enabled",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 18,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-019",
      "title": "Enforce gsnake-editor 80% line threshold in CI",
      "description": "As a maintainer, I want gsnake-editor coverage to block merges below 80% so editor test coverage cannot regress.",
      "acceptanceCriteria": [
        "Set gsnake-editor coverage threshold to at least 80% line coverage",
        "Coverage job fails when gsnake-editor drops below threshold",
        "Coverage artifact upload remains enabled",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 19,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-020",
      "title": "Enforce gsnake-core and gsnake-levels 80% line thresholds",
      "description": "As a maintainer, I want Rust package coverage to block merges below 80% so engine and levels coverage cannot regress.",
      "acceptanceCriteria": [
        "Set cargo-llvm-cov fail-under-lines to at least 80 for gsnake-core",
        "Set cargo-llvm-cov fail-under-lines to at least 80 for gsnake-levels",
        "Rust coverage jobs fail when thresholds are not met",
        "Coverage artifact upload remains enabled",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 20,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-021",
      "title": "Make coverage and E2E checks required merge gates",
      "description": "As a release owner, I want all coverage and E2E checks required on PRs so merges are blocked unless quality gates pass.",
      "acceptanceCriteria": [
        "Coverage and E2E workflows are configured as required status checks",
        "PR validation fails when any required coverage or E2E check fails",
        "Root and package CI behavior is consistent for blocking enforcement",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 21,
      "passes": false,
      "notes": ""
    }
  ]
}
